NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_wificore_peripherals.h
/*

Copyright (c) 2010 - 2026, Nordic Semiconductor ASA All rights reserved.

SPDX-License-Identifier: BSD-3-Clause

Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions are met:

1. Redistributions of source code must retain the above copyright notice, this
   list of conditions and the following disclaimer.

2. Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the distribution.

3. Neither the name of Nordic Semiconductor ASA nor the names of its
   contributors may be used to endorse or promote products derived from this
   software without specific prior written permission.

THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
IMPLIED WARRANTIES OF MERCHANTABILITY, AND FITNESS FOR A PARTICULAR PURPOSE
ARE DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
POSSIBILITY OF SUCH DAMAGE.

*/

#ifndef NRF7120E_ENGA_WIFICORE_PERIPHERALS_H
#define NRF7120E_ENGA_WIFICORE_PERIPHERALS_H

#ifdef __cplusplus
    extern "C" {
#endif

#include <stdbool.h>
/*VPR peripheral registers*/
#define VPR_PRESENT 1
#define VPR_COUNT 3

#define LMAC_VPR_RISCV_EXTN_E 1                      /*!< Supports RV32E (Base Integer Instruction Set embedded)               */
#define LMAC_VPR_RISCV_EXTN_M 1                      /*!< Supports M extension (Integer Multiplication and Division)           */
#define LMAC_VPR_RISCV_EXTN_C 1                      /*!< Supports C extension (compressed instructions)                       */
#define LMAC_VPR_RISCV_EXTN_ZBA 1                    /*!< Supports Zba extension (Bit Manipulation - Address generation
                                                          instructions)*/
#define LMAC_VPR_RISCV_EXTN_ZBB 1                    /*!< Supports Zbb extension (Bit Manipulation - Basic bit manipulation)   */
#define LMAC_VPR_RISCV_EXTN_ZBC 1                    /*!< Supports Zbc extension (Bit Manipulation - Carry-less multiplication)*/
#define LMAC_VPR_RISCV_EXTN_ZBS 1                    /*!< Supports Zbs extension (Bit Manipulation - Single bit instructions)  */
#define LMAC_VPR_RISCV_EXTN_ZCB 1                    /*!< Supports Zcb extension (code-size saving instructions)               */
#define LMAC_VPR_RISCV_EXTN_ZIFENCEI 0               /*!< Does not support FENCE.I instruction (use FENCE instruction instead) */
#define LMAC_VPR_RISCV_EXTN_ZICSR 1                  /*!< Supports CSR (Control and Status Register) instructions              */
#define LMAC_VPR_RISCV_EXTN_ZICNTR 0                 /*!< Does not support CNTR (base counter) instructions                    */
#define LMAC_VPR_RISCV_EXTN_SMCLIC 1                 /*!< Supports M-mode CLIC (interrupt controller)                          */
#define LMAC_VPR_RISCV_EXTN_SMCLICCONFIG 1           /*!< Supports MCLICCFG register                                           */
#define LMAC_VPR_RISCV_EXTN_SDEXT 1                  /*!< Supports external debugger                                           */
#define LMAC_VPR_RISCV_EXTN_SDTRIG 1                 /*!< Debugger supports triggers (breakpoints)                             */
#define LMAC_VPR_INIT_PC_RESET_VALUE 0x28080000      /*!< Boot vector (INIT_PC_RESET_VALUE): 0x28080000                        */
#define LMAC_VPR_VPR_START_RESET_VALUE 0             /*!< Self-booting (VPR_START_RESET_VALUE): 0                              */
#define LMAC_VPR_RAM_BASE_ADDR 0x28000000            /*!< VPR RAM base address (RAM_BASE_ADDR): 0x28000000                     */
#define LMAC_VPR_RAM_SZ 18                           /*!< VPR RAM size (RAM_SZ): 18 (Value in bytes is computed as 2^(RAM
                                                          size))*/
#define LMAC_VPR_VPRSAVEDCTX_REGNAME NRF_MEMCONFWIFI->POWER[0].RET /*!< (unspecified)                                          */
#define LMAC_VPR_VPRSAVEDCTX_REGBIT 0                /*!< (unspecified)                                                        */
#define LMAC_VPR_RETAINED 0                          /*!< Retain registers in Deep Sleep mode: 0                               */
#define LMAC_VPR_VPRSAVEDCTX 1                       /*!< Restore VPR context at VPR reset using register
                                                          [NRF_MEMCONFWIFI->POWER0.RET].MEM[0]*/
#define LMAC_VPR_VPRSAVEADDR 0x28000000              /*!< VPR context save address: 0x28000000                                 */
#define LMAC_VPR_VPRSAVESIZE 0                       /*!< VPR context save size: 0 bytes                                       */
#define LMAC_VPR_VPRREMAPADDRVTOB 0x00000000         /*!< VPR remap address: 0x00000000                                        */
#define LMAC_VPR_VEVIF_NTASKS_MIN 16                 /*!< VEVIF tasks: 16..23                                                  */
#define LMAC_VPR_VEVIF_NTASKS_MAX 23                 /*!< VEVIF tasks: 16..23                                                  */
#define LMAC_VPR_VEVIF_NTASKS_SIZE 24                /*!< VEVIF tasks: 16..23                                                  */
#define LMAC_VPR_VEVIF_TASKS_MASK 0x00FF0000         /*!< Mask of supported VEVIF tasks: 0x00FF0000                            */
#define LMAC_VPR_VEVIF_NDPPI_MIN 0                   /*!< VEVIF DPPI indices: 0..0                                             */
#define LMAC_VPR_VEVIF_NDPPI_MAX 0                   /*!< VEVIF DPPI indices: 0..0                                             */
#define LMAC_VPR_VEVIF_NDPPI_SIZE 1                  /*!< VEVIF DPPI indices: 0..0                                             */
#define LMAC_VPR_VEVIF_DPPI_MASK 0x00000000          /*!< Mask of supported VEVIF DPPI channels: 0x00000000                    */
#define LMAC_VPR_VEVIF_NEVENTS_MIN 0                 /*!< VEVIF events: 0..0                                                   */
#define LMAC_VPR_VEVIF_NEVENTS_MAX 0                 /*!< VEVIF events: 0..0                                                   */
#define LMAC_VPR_VEVIF_NEVENTS_SIZE 1                /*!< VEVIF events: 0..0                                                   */
#define LMAC_VPR_VEVIF_EVENTS_MASK 0x01000000        /*!< Mask of supported VEVIF events: 0x01000000                           */
#define LMAC_VPR_DEBUGGER_OFFSET 1024                /*!< Debugger interface register offset: 0x48000400                       */
#define LMAC_VPR_RTP_VPR_1_5 1                       /*!< New RTP features                                                     */
#define LMAC_VPR_VPR_BITIS_1_6 0                     /*!< (unspecified)                                                        */

#define UMAC_VPR_RISCV_EXTN_E 1                      /*!< Supports RV32E (Base Integer Instruction Set embedded)               */
#define UMAC_VPR_RISCV_EXTN_M 1                      /*!< Supports M extension (Integer Multiplication and Division)           */
#define UMAC_VPR_RISCV_EXTN_C 1                      /*!< Supports C extension (compressed instructions)                       */
#define UMAC_VPR_RISCV_EXTN_ZBA 1                    /*!< Supports Zba extension (Bit Manipulation - Address generation
                                                          instructions)*/
#define UMAC_VPR_RISCV_EXTN_ZBB 1                    /*!< Supports Zbb extension (Bit Manipulation - Basic bit manipulation)   */
#define UMAC_VPR_RISCV_EXTN_ZBC 1                    /*!< Supports Zbc extension (Bit Manipulation - Carry-less multiplication)*/
#define UMAC_VPR_RISCV_EXTN_ZBS 1                    /*!< Supports Zbs extension (Bit Manipulation - Single bit instructions)  */
#define UMAC_VPR_RISCV_EXTN_ZCB 1                    /*!< Supports Zcb extension (code-size saving instructions)               */
#define UMAC_VPR_RISCV_EXTN_ZIFENCEI 0               /*!< Does not support FENCE.I instruction (use FENCE instruction instead) */
#define UMAC_VPR_RISCV_EXTN_ZICSR 1                  /*!< Supports CSR (Control and Status Register) instructions              */
#define UMAC_VPR_RISCV_EXTN_ZICNTR 0                 /*!< Does not support CNTR (base counter) instructions                    */
#define UMAC_VPR_RISCV_EXTN_SMCLIC 1                 /*!< Supports M-mode CLIC (interrupt controller)                          */
#define UMAC_VPR_RISCV_EXTN_SMCLICCONFIG 1           /*!< Supports MCLICCFG register                                           */
#define UMAC_VPR_RISCV_EXTN_SDEXT 1                  /*!< Supports external debugger                                           */
#define UMAC_VPR_RISCV_EXTN_SDTRIG 1                 /*!< Debugger supports triggers (breakpoints)                             */
#define UMAC_VPR_INIT_PC_RESET_VALUE 0x28180000      /*!< Boot vector (INIT_PC_RESET_VALUE): 0x28180000                        */
#define UMAC_VPR_VPR_START_RESET_VALUE 0             /*!< Self-booting (VPR_START_RESET_VALUE): 0                              */
#define UMAC_VPR_RAM_BASE_ADDR 0x28100000            /*!< VPR RAM base address (RAM_BASE_ADDR): 0x28100000                     */
#define UMAC_VPR_RAM_SZ 19                           /*!< VPR RAM size (RAM_SZ): 19 (Value in bytes is computed as 2^(RAM
                                                          size))*/
#define UMAC_VPR_VPRSAVEDCTX_REGNAME NRF_MEMCONFWIFI->POWER[0].RET /*!< (unspecified)                                          */
#define UMAC_VPR_VPRSAVEDCTX_REGBIT 1                /*!< (unspecified)                                                        */
#define UMAC_VPR_RETAINED 0                          /*!< Retain registers in Deep Sleep mode: 0                               */
#define UMAC_VPR_VPRSAVEDCTX 1                       /*!< Restore VPR context at VPR reset using register
                                                          [NRF_MEMCONFWIFI->POWER0.RET].MEM[1]*/
#define UMAC_VPR_VPRSAVEADDR 0x280000180             /*!< VPR context save address: 0x280000180                                */
#define UMAC_VPR_VPRSAVESIZE 0                       /*!< VPR context save size: 0 bytes                                       */
#define UMAC_VPR_VPRREMAPADDRVTOB 0x00000000         /*!< VPR remap address: 0x00000000                                        */
#define UMAC_VPR_VEVIF_NTASKS_MIN 16                 /*!< VEVIF tasks: 16..23                                                  */
#define UMAC_VPR_VEVIF_NTASKS_MAX 23                 /*!< VEVIF tasks: 16..23                                                  */
#define UMAC_VPR_VEVIF_NTASKS_SIZE 24                /*!< VEVIF tasks: 16..23                                                  */
#define UMAC_VPR_VEVIF_TASKS_MASK 0x00FF0000         /*!< Mask of supported VEVIF tasks: 0x00FF0000                            */
#define UMAC_VPR_VEVIF_NDPPI_MIN 0                   /*!< VEVIF DPPI indices: 0..0                                             */
#define UMAC_VPR_VEVIF_NDPPI_MAX 0                   /*!< VEVIF DPPI indices: 0..0                                             */
#define UMAC_VPR_VEVIF_NDPPI_SIZE 1                  /*!< VEVIF DPPI indices: 0..0                                             */
#define UMAC_VPR_VEVIF_DPPI_MASK 0x00000000          /*!< Mask of supported VEVIF DPPI channels: 0x00000000                    */
#define UMAC_VPR_VEVIF_NEVENTS_MIN 0                 /*!< VEVIF events: 0..0                                                   */
#define UMAC_VPR_VEVIF_NEVENTS_MAX 0                 /*!< VEVIF events: 0..0                                                   */
#define UMAC_VPR_VEVIF_NEVENTS_SIZE 1                /*!< VEVIF events: 0..0                                                   */
#define UMAC_VPR_VEVIF_EVENTS_MASK 0x01000000        /*!< Mask of supported VEVIF events: 0x01000000                           */
#define UMAC_VPR_DEBUGGER_OFFSET 1024                /*!< Debugger interface register offset: 0x48004400                       */
#define UMAC_VPR_RTP_VPR_1_5 1                       /*!< New RTP features                                                     */
#define UMAC_VPR_VPR_BITIS_1_6 0                     /*!< (unspecified)                                                        */

#define VPR00_RISCV_EXTN_E 1                         /*!< Supports RV32E (Base Integer Instruction Set embedded)               */
#define VPR00_RISCV_EXTN_M 1                         /*!< Supports M extension (Integer Multiplication and Division)           */
#define VPR00_RISCV_EXTN_C 1                         /*!< Supports C extension (compressed instructions)                       */
#define VPR00_RISCV_EXTN_ZBA 1                       /*!< Supports Zba extension (Bit Manipulation - Address generation
                                                          instructions)*/
#define VPR00_RISCV_EXTN_ZBB 1                       /*!< Supports Zbb extension (Bit Manipulation - Basic bit manipulation)   */
#define VPR00_RISCV_EXTN_ZBC 1                       /*!< Supports Zbc extension (Bit Manipulation - Carry-less multiplication)*/
#define VPR00_RISCV_EXTN_ZBS 1                       /*!< Supports Zbs extension (Bit Manipulation - Single bit instructions)  */
#define VPR00_RISCV_EXTN_ZCB 1                       /*!< Supports Zcb extension (code-size saving instructions)               */
#define VPR00_RISCV_EXTN_ZIFENCEI 0                  /*!< Does not support FENCE.I instruction (use FENCE instruction instead) */
#define VPR00_RISCV_EXTN_ZICSR 1                     /*!< Supports CSR (Control and Status Register) instructions              */
#define VPR00_RISCV_EXTN_ZICNTR 0                    /*!< Does not support CNTR (base counter) instructions                    */
#define VPR00_RISCV_EXTN_SMCLIC 1                    /*!< Supports M-mode CLIC (interrupt controller)                          */
#define VPR00_RISCV_EXTN_SMCLICCONFIG 1              /*!< Supports MCLICCFG register                                           */
#define VPR00_RISCV_EXTN_SDEXT 1                     /*!< Supports external debugger                                           */
#define VPR00_RISCV_EXTN_SDTRIG 1                    /*!< Debugger supports triggers (breakpoints)                             */
#define VPR00_INIT_PC_RESET_VALUE 0x01000000         /*!< Boot vector (INIT_PC_RESET_VALUE): 0x01000000                        */
#define VPR00_VPR_START_RESET_VALUE 1                /*!< Self-booting (VPR_START_RESET_VALUE): 1                              */
#define VPR00_RAM_BASE_ADDR 0x20000000               /*!< VPR RAM base address (RAM_BASE_ADDR): 0x20000000                     */
#define VPR00_RAM_SZ 20                              /*!< VPR RAM size (RAM_SZ): 20 (Value in bytes is computed as 2^(RAM
                                                          size))*/
#define VPR00_VPRSAVEDCTX_REGNAME NRF_MEMCONF->POWER[1].RET /*!< (unspecified)                                                 */
#define VPR00_VPRSAVEDCTX_REGBIT 0                   /*!< (unspecified)                                                        */
#define VPR00_RETAINED 0                             /*!< Retain registers in Deep Sleep mode: 0                               */
#define VPR00_VPRSAVEDCTX 1                          /*!< Restore VPR context at VPR reset using register
                                                          [NRF_MEMCONF->POWER1.RET].MEM[0]*/
#define VPR00_VPRSAVEADDR 0x200FEC00                 /*!< VPR context save address: 0x200FEC00                                 */
#define VPR00_VPRSAVESIZE 1024                       /*!< VPR context save size: 1024 bytes                                    */
#define VPR00_VPRREMAPADDRVTOB 0x00000000            /*!< VPR remap address: 0x00000000                                        */
#define VPR00_VEVIF_NTASKS_MIN 16                    /*!< VEVIF tasks: 16..22                                                  */
#define VPR00_VEVIF_NTASKS_MAX 22                    /*!< VEVIF tasks: 16..22                                                  */
#define VPR00_VEVIF_NTASKS_SIZE 23                   /*!< VEVIF tasks: 16..22                                                  */
#define VPR00_VEVIF_TASKS_MASK 0x007F0000            /*!< Mask of supported VEVIF tasks: 0x007F0000                            */
#define VPR00_VEVIF_NDPPI_MIN 16                     /*!< VEVIF DPPI indices: 16..19                                           */
#define VPR00_VEVIF_NDPPI_MAX 19                     /*!< VEVIF DPPI indices: 16..19                                           */
#define VPR00_VEVIF_NDPPI_SIZE 20                    /*!< VEVIF DPPI indices: 16..19                                           */
#define VPR00_VEVIF_DPPI_MASK 0x000F0000             /*!< Mask of supported VEVIF DPPI channels: 0x000F0000                    */
#define VPR00_VEVIF_NEVENTS_MIN 16                   /*!< VEVIF events: 16..22                                                 */
#define VPR00_VEVIF_NEVENTS_MAX 22                   /*!< VEVIF events: 16..22                                                 */
#define VPR00_VEVIF_NEVENTS_SIZE 23                  /*!< VEVIF events: 16..22                                                 */
#define VPR00_VEVIF_EVENTS_MASK 0x00100000           /*!< Mask of supported VEVIF events: 0x00100000                           */
#define VPR00_DEBUGGER_OFFSET 1024                   /*!< Debugger interface register offset: 0x5004C400                       */
#define VPR00_RTP_VPR_1_5 1                          /*!< New RTP features                                                     */
#define VPR00_VPR_BITIS_1_6 0                        /*!< (unspecified)                                                        */

/*MVDMA performs direct-memory-accesses between memories. Data is transferred according to job descriptor lists. Each transfer has corresponding source and sink descriptor lists with matching data amounts. The lists are in memory and they contain data buffer information, address pointers, buffer sizes and data type attributes.*/

